ekawahyu/MSP430Ware/eclipse/plugins/com.ti.mcu.msp430.driverlib.product.ui_1.90.0.65/resources/empty/MSP430FR5xx_6xx/driverlib/MSP430FR5xx_6xx/adc12_b.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2014, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
//*****************************************************************************
//
// adc12_b.c - Driver for the adc12_b Module.
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup adc12_b_api
//! @{
//
//*****************************************************************************

#include "inc/hw_regaccess.h"
#include "inc/hw_memmap.h"

#ifdef __MSP430_HAS_ADC12_B__
#include "adc12_b.h"

#include <assert.h>

//*****************************************************************************
//
//! \brief DEPRECATED - Initializes the ADC12B Module.
//!
//! This function initializes the ADC module to allow for analog-to-digital
//! conversions. Specifically this function sets up the sample-and-hold signal
//! and clock sources for the ADC core to use for conversions. Upon successful
//! completion of the initialization all of the ADC control registers will be
//! reset, excluding the memory controls and reference module bits, the given
//! parameters will be set, and the ADC core will be turned on (Note, that the
//! ADC core only draws power during conversions and remains off when not
//! converting).Note that sample/hold signal sources are device dependent. Note
//! that if re-initializing the ADC after starting a conversion with the
//! startConversion() function, the disableConversion() must be called BEFORE
//! this function can be called.
//!
//! \param baseAddress is the base address of the ADC12B module.
//! \param sampleHoldSignalSourceSelect is the signal that will trigger a
//!        sample-and-hold for an input signal to be converted.
//!        Valid values are:
//!        - \b ADC12_B_SAMPLEHOLDSOURCE_SC [Default]
//!        - \b ADC12_B_SAMPLEHOLDSOURCE_1
//!        - \b ADC12_B_SAMPLEHOLDSOURCE_2
//!        - \b ADC12_B_SAMPLEHOLDSOURCE_3
//!        - \b ADC12_B_SAMPLEHOLDSOURCE_4
//!        - \b ADC12_B_SAMPLEHOLDSOURCE_5
//!        - \b ADC12_B_SAMPLEHOLDSOURCE_6
//!        - \b ADC12_B_SAMPLEHOLDSOURCE_7 - This parameter is device specific
//!           and sources should be found in the device's datasheet.
//!        \n Modified bits are \b ADC12SHSx of \b ADC12CTL1 register.
//! \param clockSourceSelect selects the clock that will be used by the ADC12B
//!        core, and the sampling timer if a sampling pulse mode is enabled.
//!        Valid values are:
//!        - \b ADC12_B_CLOCKSOURCE_ADC12OSC [Default] - MODOSC 5 MHz
//!           oscillator from the UCS
//!        - \b ADC12_B_CLOCKSOURCE_ACLK - The Auxiliary Clock
//!        - \b ADC12_B_CLOCKSOURCE_MCLK - The Master Clock
//!        - \b ADC12_B_CLOCKSOURCE_SMCLK - The Sub-Master Clock
//!        \n Modified bits are \b ADC12SSELx of \b ADC12CTL1 register.
//! \param clockSourceDivider selects the amount that the clock will be
//!        divided.
//!        Valid values are:
//!        - \b ADC12_B_CLOCKDIVIDER_1 [Default]
//!        - \b ADC12_B_CLOCKDIVIDER_2
//!        - \b ADC12_B_CLOCKDIVIDER_3
//!        - \b ADC12_B_CLOCKDIVIDER_4
//!        - \b ADC12_B_CLOCKDIVIDER_5
//!        - \b ADC12_B_CLOCKDIVIDER_6
//!        - \b ADC12_B_CLOCKDIVIDER_7
//!        - \b ADC12_B_CLOCKDIVIDER_8
//!        \n Modified bits are \b ADC12DIVx of \b ADC12CTL1 register.
//! \param clockSourcePredivider selects the amount that the clock will be
//!        predivided.
//!        Valid values are:
//!        - \b ADC12_B_CLOCKPREDIVIDER__1 [Default]
//!        - \b ADC12_B_CLOCKPREDIVIDER__4
//!        - \b ADC12_B_CLOCKPREDIVIDER__32
//!        - \b ADC12_B_CLOCKPREDIVIDER__64
//!        \n Modified bits are \b ADC12PDIV of \b ADC12CTL1 register.
//! \param internalChannelMap selects what internal channel to map for ADC
//!        input channels
//!        Valid values are:
//!        - \b ADC12_B_MAPINTCH3
//!        - \b ADC12_B_MAPINTCH2
//!        - \b ADC12_B_MAPINTCH1
//!        - \b ADC12_B_MAPINTCH0
//!        - \b ADC12_B_TEMPSENSEMAP
//!        - \b ADC12_B_BATTMAP
//!        - \b ADC12_B_NOINTCH
//!        \n Modified bits of \b ADC12CTL3 register.
//!
//! \return STATUS_SUCCESS or STATUS_FAILURE of the initialization process.
//
//*****************************************************************************
bool ADC12_B_init (uint16_t baseAddress,
    uint16_t sampleHoldSignalSourceSelect,
    uint8_t clockSourceSelect,
    uint16_t clockSourceDivider,
    uint16_t clockSourcePredivider,
    uint16_t internalChannelMap)
{
    ADC12_B_initializeParam param = {0};
    param.sampleHoldSignalSourceSelect = sampleHoldSignalSourceSelect;
    param.clockSourceSelect = clockSourceSelect;
    param.clockSourceDivider = clockSourceDivider;
    param.clockSourcePredivider = clockSourcePredivider;
    param.internalChannelMap = internalChannelMap;

    return ADC12_B_initialize(baseAddress, &param);
}

//*****************************************************************************
//
//! \brief Initializes the ADC12B Module.
//!
//! This function initializes the ADC module to allow for analog-to-digital
//! conversions. Specifically this function sets up the sample-and-hold signal
//! and clock sources for the ADC core to use for conversions. Upon successful
//! completion of the initialization all of the ADC control registers will be
//! reset, excluding the memory controls and reference module bits, the given
//! parameters will be set, and the ADC core will be turned on (Note, that the
//! ADC core only draws power during conversions and remains off when not
//! converting).Note that sample/hold signal sources are device dependent. Note
//! that if re-initializing the ADC after starting a conversion with the
//! startConversion() function, the disableConversion() must be called BEFORE
//! this function can be called.
//!
//! \param baseAddress is the base address of the ADC12B module.
//! \param param is the pointer to struct for initialization.
//!
//! \return STATUS_SUCCESS or STATUS_FAILURE of the initialization process.
//
//*****************************************************************************
bool ADC12_B_initialize(uint16_t baseAddress, ADC12_B_initializeParam *param)
{
    assert(param != 0);
    assert(param->sampleHoldSignalSourceSelect <= ADC12_B_SAMPLEHOLDSOURCE_3);
    assert(param->clockSourceSelect <= ADC12_B_CLOCKSOURCE_SMCLK);
    assert(param->clockSourceDivider <= ADC12_B_CLOCKDIVIDER_8);
    assert(param->internalChannelMap <= ADC12_B_BATTMAP);
    assert((param->clockSourcePredivider == ADC12_B_CLOCKPREDIVIDER__1) ||
        (param->clockSourcePredivider == ADC12_B_CLOCKPREDIVIDER__4) ||
        (param->clockSourcePredivider == ADC12_B_CLOCKPREDIVIDER__32) ||
        (param->clockSourcePredivider == ADC12_B_CLOCKPREDIVIDER__64)
    );
    
