ekawahyu/MSP430Ware/eclipse/plugins/com.ti.mcu.msp430.driverlib.product.ui_1.90.0.65/resources/empty/MSP430FR5xx_6xx/driverlib/MSP430FR5xx_6xx/adc12_b.c
    //Set clock cycle hold counts and msc bit
    HWREG16(baseAddress + OFS_ADC12CTL0) |= clockCycleHoldCountLowMem
                                          + (clockCycleHoldCountHighMem << 4)
                                          + multipleSamplesEnabled;
}

//*****************************************************************************
//
//! \brief Disables Sampling Timer Pulse Mode.
//!
//! Disables the Sampling Timer Pulse Mode. Note that if a conversion has been
//! started with the startConversion() function, then a call to
//! disableConversions() is required before this function may be called.
//!
//! \param baseAddress is the base address of the ADC12B module.
//!
//! \return None
//
//*****************************************************************************
void ADC12_B_disableSamplingTimer (uint16_t baseAddress)
{
    //Make sure the ENC bit is cleared before disabling sampling pulse mode
    assert( !(HWREG8(baseAddress + OFS_ADC12CTL0_L) & ADC12ENC) );

    HWREG16(baseAddress + OFS_ADC12CTL1) &= ~(ADC12SHP);
}

//*****************************************************************************
//
//! \brief DEPRECATED - Configures the controls of the selected memory buffer.
//!
//! Maps an input signal conversion into the selected memory buffer, as well as
//! the positive and negative reference voltages for each conversion being
//! stored into this memory buffer. If the internal reference is used for the
//! positive reference voltage, the internal REF module must be used to control
//! the voltage level. Note that if a conversion has been started with the
//! startConversion() function, then a call to disableConversions() is required
//! before this function may be called.
//!
//! \param baseAddress is the base address of the ADC12B module.
//! \param memoryBufferControlIndex is the selected memory buffer to set the
//!        configuration for.
//!        Valid values are:
//!        - \b ADC12_B_MEMORY_0
//!        - \b ADC12_B_MEMORY_1
//!        - \b ADC12_B_MEMORY_2
//!        - \b ADC12_B_MEMORY_3
//!        - \b ADC12_B_MEMORY_4
//!        - \b ADC12_B_MEMORY_5
//!        - \b ADC12_B_MEMORY_6
//!        - \b ADC12_B_MEMORY_7
//!        - \b ADC12_B_MEMORY_8
//!        - \b ADC12_B_MEMORY_9
//!        - \b ADC12_B_MEMORY_10
//!        - \b ADC12_B_MEMORY_11
//!        - \b ADC12_B_MEMORY_12
//!        - \b ADC12_B_MEMORY_13
//!        - \b ADC12_B_MEMORY_14
//!        - \b ADC12_B_MEMORY_15
//!        - \b ADC12_B_MEMORY_16
//!        - \b ADC12_B_MEMORY_17
//!        - \b ADC12_B_MEMORY_18
//!        - \b ADC12_B_MEMORY_19
//!        - \b ADC12_B_MEMORY_20
//!        - \b ADC12_B_MEMORY_21
//!        - \b ADC12_B_MEMORY_22
//!        - \b ADC12_B_MEMORY_23
//!        - \b ADC12_B_MEMORY_24
//!        - \b ADC12_B_MEMORY_25
//!        - \b ADC12_B_MEMORY_26
//!        - \b ADC12_B_MEMORY_27
//!        - \b ADC12_B_MEMORY_28
//!        - \b ADC12_B_MEMORY_29
//!        - \b ADC12_B_MEMORY_30
//!        - \b ADC12_B_MEMORY_31
//! \param inputSourceSelect is the input that will store the converted data
//!        into the specified memory buffer.
//!        Valid values are:
//!        - \b ADC12_B_INPUT_A0 [Default]
//!        - \b ADC12_B_INPUT_A1
//!        - \b ADC12_B_INPUT_A2
//!        - \b ADC12_B_INPUT_A3
//!        - \b ADC12_B_INPUT_A4
//!        - \b ADC12_B_INPUT_A5
//!        - \b ADC12_B_INPUT_A6
//!        - \b ADC12_B_INPUT_A7
//!        - \b ADC12_B_INPUT_A8
//!        - \b ADC12_B_INPUT_A9
//!        - \b ADC12_B_INPUT_A10
//!        - \b ADC12_B_INPUT_A11
//!        - \b ADC12_B_INPUT_A12
//!        - \b ADC12_B_INPUT_A13
//!        - \b ADC12_B_INPUT_A14
//!        - \b ADC12_B_INPUT_A15
//!        - \b ADC12_B_INPUT_A16
//!        - \b ADC12_B_INPUT_A17
//!        - \b ADC12_B_INPUT_A18
//!        - \b ADC12_B_INPUT_A19
//!        - \b ADC12_B_INPUT_A20
//!        - \b ADC12_B_INPUT_A21
//!        - \b ADC12_B_INPUT_A22
//!        - \b ADC12_B_INPUT_A23
//!        - \b ADC12_B_INPUT_A24
//!        - \b ADC12_B_INPUT_A25
//!        - \b ADC12_B_INPUT_A26
//!        - \b ADC12_B_INPUT_A27
//!        - \b ADC12_B_INPUT_A28
//!        - \b ADC12_B_INPUT_A29
//!        - \b ADC12_B_INPUT_TCMAP
//!        - \b ADC12_B_INPUT_BATMAP
//!        \n Modified bits are \b ADC12INCHx of \b ADC12MCTLx register.
//! \param refVoltageSourceSelect is the reference voltage source to set as the
//!        upper/lower limits for the conversion stored in the specified
//!        memory.
//!        Valid values are:
//!        - \b ADC12_B_VREFPOS_AVCC_VREFNEG_VSS [Default]
//!        - \b ADC12_B_VREFPOS_INTBUF_VREFNEG_VSS
//!        - \b ADC12_B_VREFPOS_EXTNEG_VREFNEG_VSS
//!        - \b ADC12_B_VREFPOS_EXTBUF_VREFNEG_VSS
//!        - \b ADC12_B_VREFPOS_EXTPOS_VREFNEG_VSS
//!        - \b ADC12_B_VREFPOS_AVCC_VREFNEG_EXTBUF
//!        - \b ADC12_B_VREFPOS_AVCC_VREFNEG_EXTPOS
//!        - \b ADC12_B_VREFPOS_INTBUF_VREFNEG_EXTPOS
//!        - \b ADC12_B_VREFPOS_AVCC_VREFNEG_INTBUF
//!        - \b ADC12_B_VREFPOS_EXTPOS_VREFNEG_INTBUF
//!        - \b ADC12_B_VREFPOS_AVCC_VREFNEG_EXTNEG
//!        - \b ADC12_B_VREFPOS_INTBUF_VREFNEG_EXTNEG
//!        - \b ADC12_B_VREFPOS_EXTPOS_VREFNEG_EXTNEG
//!        - \b ADC12_B_VREFPOS_EXTBUF_VREFNEG_EXTNEG
//!        \n Modified bits are \b ADC12VRSEL of \b ADC12MCTLx register.
//! \param endOfSequence indicates that the specified memory buffer will be the
//!        end of the sequence if a sequenced conversion mode is selected
//!        Valid values are:
//!        - \b ADC12_B_NOTENDOFSEQUENCE [Default] - The specified memory
//!           buffer will NOT be the end of the sequence OR a sequenced
//!           conversion mode is not selected.
//!        - \b ADC12_B_ENDOFSEQUENCE - The specified memory buffer will be the
//!           end of the sequence.
//!        \n Modified bits are \b ADC12EOS of \b ADC12MCTLx register.
//! \param windowComparatorSelect sets the window comparator mode
//!        Valid values are:
//!        - \b ADC12_B_WINDOW_COMPARATOR_DISABLE [Default]
//!        - \b ADC12_B_WINDOW_COMPARATOR_ENABLE
//! \param differentialModeSelect sets the differential mode
//!        Valid values are:
//!        - \b ADC12_B_DIFFERENTIAL_MODE_DISABLE [Default]
//!        - \b ADC12_B_DIFFERENTIAL_MODE_ENABLE
//!
//! \return None
//
//*****************************************************************************
void ADC12_B_memoryConfigure (uint16_t baseAddress,
    uint8_t memoryBufferControlIndex,
    uint8_t inputSourceSelect,
    uint16_t refVoltageSourceSelect,
    uint16_t endOfSequence,
    uint16_t windowComparatorSelect,
    uint16_t differentialModeSelect
    )
{
    ADC12_B_configureMemoryParam param = {0};
    param.memoryBufferControlIndex = memoryBufferControlIndex;
    param.inputSourceSelect = inputSourceSelect;
    param.refVoltageSourceSelect = refVoltageSourceSelect;
    param.endOfSequence = endOfSequence;
    param.windowComparatorSelect = windowComparatorSelect;
    param.differentialModeSelect = differentialModeSelect;

    ADC12_B_configureMemory(baseAddress, &param);
}

//*****************************************************************************
//
//! \brief Configures the controls of the selected memory buffer.
//!
//! Maps an input signal conversion into the selected memory buffer, as well as
//! the positive and negative reference voltages for each conversion being
//! stored into this memory buffer. If the internal reference is used for the
//! positive reference voltage, the internal REF module must be used to control
//! the voltage level. Note that if a conversion has been started with the
//! startConversion() function, then a call to disableConversions() is required
//! before this function may be called.
//!
//! \param baseAddress is the base address of the ADC12B module.
//! \param param is the pointer to struct for ADC12B memory configuration.
//!
//! \return None
//
//*****************************************************************************
void ADC12_B_configureMemory(uint16_t baseAddress, 
    ADC12_B_configureMemoryParam *param)
{
    assert(param != 0);

    //Make sure the ENC bit is cleared before configuring a Memory Buffer Control
    assert( !(HWREG8(baseAddress + OFS_ADC12CTL0_L) & ADC12ENC) );

    assert(param->inputSourceSelect <= ADC12_B_INPUT_BATMAP);
    assert(param->refVoltageSourceSelect <= ADC12_B_VREFPOS_EXTBUF_VREFNEG_EXTNEG);
    
