ekawahyu/MSP430Ware/eclipse/plugins/com.ti.mcu.msp430.driverlib.product.ui_1.90.0.65/resources/empty/MSP430FR5xx_6xx/driverlib/MSP430FR5xx_6xx/adc12_b.c
    assert(
        (ADC12_B_MEMORY_0 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_1 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_2 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_3 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_4 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_5 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_6 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_7 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_8 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_9 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_10 == param->emoryBufferControlIndex) ||
        (ADC12_B_MEMORY_11 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_12 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_13 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_14 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_15 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_16 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_17 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_18 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_19 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_20 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_21 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_22 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_23 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_24 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_25 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_26 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_27 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_28 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_29 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_30 == param->memoryBufferControlIndex) ||
        (ADC12_B_MEMORY_31 == param->memoryBufferControlIndex)
    );

    //Set the offset in respect to ADC12MCTL0
    uint16_t memoryBufferControlOffset =
        (OFS_ADC12MCTL0 + param->memoryBufferControlIndex);

    //Reset the memory buffer control and Set the input source
    HWREG16(baseAddress + memoryBufferControlOffset) =
        param->inputSourceSelect //Set Input Source
        + param->refVoltageSourceSelect //Set Vref+/-
        + param->endOfSequence; //Set End of Sequence
    
    HWREG16(baseAddress + memoryBufferControlOffset)
        &= ~(ADC12WINC);
        
    HWREG16(baseAddress + memoryBufferControlOffset)
        |= param->windowComparatorSelect; 
    //(OFS_ADC12MCTL0_H + memoryIndex) == offset of OFS_ADC12MCTLX_H
    
    HWREG16(baseAddress + memoryBufferControlOffset)
        &= ~(ADC12DIF); 
        
    HWREG16(baseAddress + memoryBufferControlOffset)
        |= param->differentialModeSelect; 
    //(OFS_ADC12MCTL0_H + memoryIndex) == offset of OFS_ADC12MCTLX_H
}//*****************************************************************************
//
//! \brief Sets the high and low threshold for the window comparator feature.
//!
//! Sets the high and low threshold for the window comparator feature. Use the
//! ADC12HIIE, ADC12INIE, ADC12LOIE interrupts to utilize this feature.
//!
//! \param baseAddress is the base address of the ADC12B module.
//! \param highThreshold is the upper bound that could trip an interrupt for
//!        the window comparator.
//! \param lowThreshold is the lower bound that could trip on interrupt for the
//!        window comparator.
//!
//! \return None
//
//*****************************************************************************
void ADC12_B_setWindowCompAdvanced (uint16_t baseAddress,
    uint16_t highThreshold,
    uint16_t lowThreshold)
{
    HWREG16(baseAddress + OFS_ADC12HI) = highThreshold;
    HWREG16(baseAddress + OFS_ADC12LO) = lowThreshold;
}

//*****************************************************************************
//
//! \brief Enables selected ADC12B interrupt sources.
//!
//! Enables the indicated ADC12B interrupt sources.  Only the sources that are
//! enabled can be reflected to the processor interrupt; disabled sources have
//! no effect on the processor. <b>Does not clear interrupt flags.
//!
//! \param baseAddress is the base address of the ADC12B module.
//! \param interruptMask0 is the bit mask of the memory buffer and overflow
//!        interrupt sources to be enabled. If the desired interrupt is not
//!        available in the selection for interruptMask0, then simply pass in a
//!        '0' for this value.
//!        Valid values are:
//!        - \b ADC12_B_IE0
//!        - \b ADC12_B_IE1
//!        - \b ADC12_B_IE2
//!        - \b ADC12_B_IE3
//!        - \b ADC12_B_IE4
//!        - \b ADC12_B_IE5
//!        - \b ADC12_B_IE6
//!        - \b ADC12_B_IE7
//!        - \b ADC12_B_IE8
//!        - \b ADC12_B_IE9
//!        - \b ADC12_B_IE10
//!        - \b ADC12_B_IE11
//!        - \b ADC12_B_IE12
//!        - \b ADC12_B_IE13
//!        - \b ADC12_B_IE14
//!        - \b ADC12_B_IE15
//! \param interruptMask1 is the bit mask of the memory buffer and overflow
//!        interrupt sources to be enabled. If the desired interrupt is not
//!        available in the selection for interruptMask1, then simply pass in a
//!        '0' for this value.
//!        Valid values are:
//!        - \b ADC12_B_IE16
//!        - \b ADC12_B_IE17
//!        - \b ADC12_B_IE18
//!        - \b ADC12_B_IE19
//!        - \b ADC12_B_IE20
//!        - \b ADC12_B_IE21
//!        - \b ADC12_B_IE22
//!        - \b ADC12_B_IE23
//!        - \b ADC12_B_IE24
//!        - \b ADC12_B_IE25
//!        - \b ADC12_B_IE26
//!        - \b ADC12_B_IE27
//!        - \b ADC12_B_IE28
//!        - \b ADC12_B_IE29
//!        - \b ADC12_B_IE30
//!        - \b ADC12_B_IE31
//! \param interruptMask2 is the bit mask of the memory buffer and overflow
//!        interrupt sources to be enabled. If the desired interrupt is not
//!        available in the selection for interruptMask2, then simply pass in a
//!        '0' for this value.
//!        Valid values are:
//!        - \b ADC12_B_INIE - Interrupt enable for a conversion in the result
//!           register is either greater than the ADC12LO or lower than the
//!           ADC12HI threshold. GIE bit must be set to enable the interrupt.
//!        - \b ADC12_B_LOIE - Interrupt enable for the falling short of the
//!           lower limit interrupt of the window comparator for the result
//!           register. GIE bit must be set to enable the interrupt.
//!        - \b ADC12_B_HIIE - Interrupt enable for the exceeding the upper
//!           limit of the window comparator for the result register. GIE bit
//!           must be set to enable the interrupt.
//!        - \b ADC12_B_OVIE - Interrupt enable for a conversion that is about
//!           to save to a memory buffer that has not been read out yet. GIE
//!           bit must be set to enable the interrupt.
//!        - \b ADC12_B_TOVIE - enable for a conversion that is about to start
//!           before the previous conversion has been completed. GIE bit must
//!           be set to enable the interrupt.
//!        - \b ADC12_B_RDYIE - enable for the local buffered reference ready
//!           signal. GIE bit must be set to enable the interrupt.
//!
//! Modified bits of \b ADC12IERx register.
//!
//! \return None
//
//*****************************************************************************
void ADC12_B_enableInterrupt (uint16_t baseAddress,
    uint16_t interruptMask0,
    uint16_t interruptMask1,
    uint16_t interruptMask2)
{
    assert(interruptMask2 <= (
			ADC12_B_INIE + ADC12_B_LOIE + ADC12_B_HIIE + ADC12_B_OVIE
            + ADC12_B_TOVIE + ADC12_B_RDYIE
			));

